Repository: taku0/lambda_ja
Catalog: lambda_ja-level1.tmx
Source language: en_us
Languages: ja

source: When the terminal operation is initiated, the stream pipeline is executed sequentially or in parallel depending on the mode of the stream on which it is invoked.
ja: 末端処理が開始した場合、ストリームパイプラインは末端処理が呼び出されたストリームのモードに従って逐次的または並列に実行される。

source: When the terminal operation is initiated, the stream pipeline is executed sequentially or in parallel depending on the orientation of the stream on which it is invoked.
ja: 末端処理が開始した場合、ストリームパイプラインは末端処理が呼び出されたストリームの方針に従って逐次的または並列に実行される。

source: Whether a stream will execute in serial or parallel can be determined with the {@code isParallel()} method, and the orientation of a stream can be modified with the {@link java.util.stream.BaseStream#sequential()} and {@link java.util.stream.BaseStream#parallel()} operations.
ja: {@code Stream}が逐次的に実行されるか並列に実行されるかは{@code Stream#isParallel}によって決定でき、ストリームの方針は{@code sequential()}処理や{@code parallel()}処理によって変更できる。

source: Whether or not a stream has an encounter order depends on the source and the intermediate operations.
ja: 出現順順序の有無は情報源と中間処理によって決まる。

source: While collections have a finite size, streams need not.
ja: コレクションは有限の大きさを持つが、ストリームはその必要はない。

source: While such a spliterator will work, it will likely offer poor parallel performance, since we have lost sizing information (how big is the underlying data set), as well as being constrained to a simplistic splitting algorithm.
ja: このようなスプリッテレータは動作するものの、貧弱な並列演算性能を示すだろう。なぜなら大きさに関する情報(元となるデータセットがどの程度大きいのか)を失なってしまうし、単純な分割アルゴリスムしか使えないためである。

source: While this may seem a more roundabout way to perform an aggregation compared to simply mutating a running total in a loop, reduction operations parallelize more gracefully, without needing additional synchronization and with greatly reduced risk of data races.
ja: 単純に累計量をループで変更させていく方法と比べて、集計の方法としては回りくどいやりかたのように見えるが、簡約処理は余分な同期処理を必要とせずにうまく並列化でき、データ競合の危険を大幅に減らせる。

source: While {@code limit()} is generally a cheap operation on sequential stream pipelines, it can be quite expensive on ordered parallel pipelines, especially for large values of {@code maxSize}, since {@code limit(n)} is constrained to return not just any n elements, but the first n elements in the encounter order.
ja: {@code limit()}は一般的に逐次ストリームパイプラインにおいては安価な処理であるが、順序を持つ並列パイプラインにおいては、特に{@code maxSize}が大きい場合は非常に高価な処理となる場合がある。{@code limit(n)}は単にn要素を返すというだけでなく最初のn要素を返す必要があるためである。

source: While {@code skip()} is generally a cheap operation on sequential stream pipelines, it can be quite expensive on ordered parallel pipelines, especially for large values of {@code n}, since {@code skip(n)} is constrained to skip not just any n elements, but the first n elements in the encounter order.
ja: {@code skip()}は一般的に逐次ストリームパイプラインにおいては安価な処理であるが、順序を持つ並列パイプラインにおいては、特に{@code n}が大きい場合は非常に高価な処理となる場合がある。{@code skip(n)}は単にn要素以外を返すというだけでなく最初のn要素以外を返す必要があるためである。

source: With some complex reduction operations, for example a {@code collect()} that produces a {@code Map}, such as:
ja: 例えば次のような{@code Map}を生成する{@code collect()}のように、複雑な簡約処理について考える。

source: You can ensure the stream is unordered by using the {@link java.util.stream.BaseStream#unordered()} method.
ja: {@link java.util.stream.BaseStream#unordered()}メソッドを使うとストリームが順序を持たないことを保障できる。

source: a non-interfering action to perform on the elements
ja: 各要素に適用する非干渉的アクション

source: a non-interfering action to perform on the elements as they are consumed from the stream
ja: このストリームから要素が消費される際にその要素に適用される、非干渉的なアクション

source: a non-interfering, stateless function to apply to each element
ja: 各要素に適用する非干渉的で状態を持たない関数

source: a non-interfering, stateless function to apply to each element which produces a stream of new values
ja: 各要素に適用する非干渉的で状態を持たず新しい値のストリームを生成する関数

source: a non-interfering, stateless function to apply to each element which produces a {@code DoubleStream} of new values
ja: 各要素に適用する非干渉的で状態を持たず新しい値の{@code DoubleStream}を生成する関数

source: a non-interfering, stateless function to apply to each element which produces a {@code LongStream} of new values
ja: 各要素に適用する非干渉的で状態を持たず新しい値の{@code LongStream}を生成する関数

source: a non-interfering, stateless function to apply to each element which produces an {@code IntStream} of new values
ja: 各要素に適用する非干渉的で状態を持たず新しい値の{@code IntStream}を生成する関数

source: a non-interfering, stateless predicate to apply to each element to determine if it should be included
ja: 各要素に適用して、要素を含むべきかどうか決めるための非干渉的で状態を持たない述語

source: a non-interfering, stateless predicate to apply to elements of this stream
ja: このストリームの要素に適用する、非干渉的で状態を持たない述語

source: a non-interfering, stateless {@code Comparator} to be used to compare stream elements
ja: ストリームの要素を比較するのに使う非干渉的で状態を持たない{@code Comparator}

source: a non-interfering, stateless {@code Comparator} to compare elements of this stream
ja: このストリームの要素を比較するための、非干渉的で状態を持たない{@code Comparator}

source: a classifier function mapping input elements to keys
ja: 入力要素をキーに写像する分類関数

source: a collector
ja: コレクタ

source: a collector which applies the mapping function to the input elements and provides the mapped results to the downstream collector
ja: 入力要素に写像関数を適用して写像した結果を下流のコレクタに提供するコレクタ

source: a collector which performs the action of the downstream collector, followed by an additional finishing step
ja: 下流のコレクタによるアクションと、追加で仕上げ段階を実行するコレクタ

source: a collector which will accept mapped values
ja: 写像された値を受理するコレクタ

source: a concurrent, unordered {@code Collector} implementing the cascaded group-by operation
ja: カスケードされたgroup-by処理を実装した並行で順序を持たない{@code Collector}

source: a concurrent, unordered {@code Collector} implementing the group-by operation
ja: group-by処理を実装した並行で順序を持たない{@code Collector}

source: a concurrent, unordered {@code Collector} which collects elements into a {@code ConcurrentMap} whose keys are the result of applying a key mapping function to the input elements, and whose values are the result of applying a value mapping function to all input elements equal to the key and combining them using the merge function
ja: キーに写像する関数の結果をキーとし、値に写像する関数の値の結果を、キーが同じになる値全てを併合関数で併合した結果を値として、要素を{@code ConcurrentMap}に集める並行で順序を持たない{@code Collector}

source: a concurrent, unordered {@code Collector} which collects elements into a {@code ConcurrentMap} whose keys are the result of applying a key mapping function to the input elements, and whose values are the result of applying a value mapping function to the input elements
ja: キーに写像する関数を入力要素に適用した結果をキーとし、値に写像する関数を入力要素に適用した結果を値として、要素を{@code ConcurrentMap}に集める並行で順序を持たない{@code Collector}

source: a function extracting the property to be summed
ja: 和を計算する特性を抽出する関数

source: a function that creates a new result container.
ja: 新しい結果コンテナを作成する関数。

source: a function to be applied to the final result of the downstream collector
ja: 下流のコレクタの最終結果に適用される関数

source: a function to be applied to the input elements
ja: 入力要素に適用される関数

source: a function to be applied to to the previous element to produce a new element
ja: 新しい要素を生成するために以前の値に適用される関数

source: a function which combines two partial results into a combined result
ja: 部分的な結果を2つ取ってそれらを統合結果に併合する関数

source: a function which folds a value into a mutable result container
ja: 値を可変な結果コンテナに折り畳む関数。

source: a function which produces a new array of the desired type and the provided length
ja: 与えられた長さの要求された型の配列を生成する関数。

source: a function which returns a new, empty {@code Map} into which the results will be inserted
ja: 結果を挿入するための、新しい空の{@code Map}を返す関数

source: a function which returns a new, mutable result container
ja: 新しい可変な結果コンテナを返す関数

source: a function which transforms the intermediate result to the final result
ja: 中間結果を最終結果に変換する関数

source: a function which, when called, produces a new empty {@code ConcurrentMap} of the desired type
ja: 呼ばれた際に新しく適切な型の空の{@code ConcurrentMap}を返す関数

source: a function which, when called, produces a new empty {@code Map} of the desired type
ja: 呼ばれた際に新しく適切な型の空の{@code Map}を返す関数

source: a mapping function to apply to each element
ja: 各要素に適用する写像関数

source: a mapping function to apply to each input value
ja: 各入力要素に適用される写像関数

source: a mapping function to produce keys
ja: キーを生成する写像関数

source: a mapping function to produce values
ja: 値を生成する写像関数

source: a merge function, used to resolve collisions between values associated with the same key, as supplied to {@link Map#merge(Object, Object, BiFunction)}
ja: {@link Map#merge(Object, Object, BiFunction)}に与えられる関数と同様に、同じキーに割り当てられた値の衝突を解決する併合関数。

source: a new infinite sequential unordered {@code DoubleStream}
ja: 新しい逐次的で順序を持たない無限{@code DoubleStream}

source: a new infinite sequential unordered {@code IntStream}
ja: 新しい逐次的で順序を持たない無限{@code IntStream}

source: a new infinite sequential unordered {@code LongStream}
ja: 新しい逐次的で順序を持たない無限{@code LongStream}

source: a new infinite sequential unordered {@code Stream}
ja: 新しい逐次的で順序を持たない無限{@code Stream}

source: a new sequential or parallel {@code DoubleStream}
ja: 新しい逐次あるいは並列{@code DoubleStream}

source: a new sequential or parallel {@code IntStream}
ja: 新しい逐次あるいは並列{@code IntStream}

source: a new sequential or parallel {@code LongStream}
ja: 新しい逐次あるいは並列{@code LongStream}

source: a new sequential or parallel {@code Stream}
ja: 新しい逐次あるいは並列{@code Stream}

source: a new sequential {@code DoubleStream}
ja: 新しい逐次的な{@code DoubleStream}

source: a new sequential {@code LongStream}
ja: 新しい逐次的な{@code LongStream}

source: a new sequential {@code Stream}
ja: 新しい逐次的な{@code Stream}

source: a parallel stream
ja: 並列ストリーム

source: a predicate used for classifying input elements
ja: 入力要素を分類する述語

source: a sequential stream
ja: 逐次的なストリーム

source: a sequential {@code IntStream} for the range of {@code int} elements
ja: {@code int}要素の範囲に対する逐次的な{@code IntStream}

source: a sequential {@code LongStream} for the range of {@code long} elements
ja: {@code long}要素の範囲に対する逐次的な{@code LongStream}

source: a singleton sequential stream
ja: 1つの要素を含む逐次的なストリーム

source: a stream builder
ja: ストリームのビルダ

source: a stream with a handler that is run if the stream is closed
ja: ストリームが閉じられた際に実行されるハンドラを伴なうストリーム

source: a {@code BinaryOperator<T>} used to reduce the input elements
ja: 入力要素を簡約するために使う{@code BinaryOperator<T>}

source: a {@code BinaryOperator<U>} used to reduce the mapped values
ja: 写像後の値を簡約するために使う{@code BinaryOperator<U>}

source: a {@code Collector} implementing the cascaded group-by operation
ja: カスケードされた"group by"処理を実装する{@code Collector}

source: a {@code Collector} implementing the cascaded partitioning operation
ja: カスケードされた分割処理を実装する{@code Collector}

source: a {@code Collector} implementing the downstream reduction
ja: 下流の簡約を実装する{@code Collector}

source: a {@code Collector} implementing the group-by operation
ja: group-by処理を実装した{@code Collector}

source: a {@code Collector} implementing the map-reduce operation
ja: 写像・簡約操作を実装する{@code Collector}

source: a {@code Collector} implementing the partitioning operation
ja: 分割処理を実装した{@code Collector}

source: a {@code Collector} implementing the summary-statistics reduction
ja: 要約統計簡約を実装する{@code Collector}

source: a {@code Collector} that concatenates the input elements into a {@code String}, in encounter order
ja: 入力要素を出現順に{@link String}に連結する{@code Collector}

source: a {@code Collector} that counts the input elements
ja: 入力要素数を数える{@code Collector}

source: a {@code Collector} that produces the maximal value
ja: 最大値を生成する{@code Collector}

source: a {@code Collector} that produces the minimal value
ja: 最小値を生成する{@code Collector}

source: a {@code Collector} that produces the sum of a derived property
ja: 得られた特性の和を計算する{@code Collector}

source: a {@code Collector} which collects all the input elements into a {@code Collection}, in encounter order
ja: 全ての入力要素を出現順に{@code Collection}に収集する{@code Collector}

source: a {@code Collector} which collects all the input elements into a {@code List}, in encounter order
ja: 全ての入力要素を出現順に{@code List}に収集する{@code Collector}

source: a {@code Collector} which collects all the input elements into a {@code Set}
ja: 全ての入力要素を{@code Set}に収集する{@code Collector}

source: a {@code Collector} which collects elements into a {@code Map} whose keys and values are the result of applying mapping functions to the input elements
ja: 写像関数の結果をキーと値として、入力要素を{@code Map}に累積する{@code Collector}

source: a {@code Collector} which collects elements into a {@code Map} whose keys are the result of applying a key mapping function to the input elements, and whose values are the result of applying a value mapping function to all input elements equal to the key and combining them using the merge function
ja: キーに写像する関数の結果をキーとし、値に写像する関数の値の結果を、キーが同じになる値全てを併合関数で併合した結果を値として、要素を{@code Map}に集める{@code Collector}

source: a {@code Collector} which implements the reduction operation
ja: 簡約操作を実装する{@code Collector}

source: a {@code Comparator} for comparing elements
ja: 要素を比較するための{@code Comparator}

source: a {@code DoubleStream} consisting of the elements of this stream, converted to {@code double}
ja: このストリームの要素を{@code double}に変換した要素からなる{@code DoubleStream}

source: a {@code DoubleSummaryStatistics} describing various summary data about the elements of this stream
ja: このストリームの要素の各種概要情報を表す{@code DoubleSummaryStatistics}

source: a {@code LongStream} consisting of the elements of this stream, converted to {@code long}
ja: このストリームの要素を{@code long}に変換した要素からなる{@code LongStream}

source: a {@code LongSummaryStatistics} describing various summary data about the elements of this stream
ja: このストリームの要素の各種概要情報を表す{@code LongSummaryStatistics}

source: a {@code Spliterator.OfInt} describing the stream elements
ja: ストリーム要素を表す{@code Spliterator.OfInt}

source: a {@code Spliterator.OfLong} describing the stream elements
ja: ストリーム要素を表す{@code Spliterator.OfLong}

source: a {@code Spliterator} describing the stream elements
ja: ストリーム要素を表す{@code Spliterator}

source: a {@code Stream} consistent of the elements of this stream, each boxed to a {@code Double}
ja: このストリームの要素を{@code Double}にボックス化した要素からなる{@code Stream}

source: a {@code Stream} consistent of the elements of this stream, each boxed to an {@code Integer}
ja: このストリームの要素を{@code Integer}にボックス化した要素からなる{@code Stream}

source: a {@code Stream} consistent of the elements of this stream, each boxed to {@code Long}
ja: このストリームの要素を{@code Long}にボックス化した要素からなる{@code Stream}

source: a {@code Supplier} of a {@code Spliterator.OfInt}
ja: {@code Spliterator.OfInt}の{@code Supplier}

source: a {@code Supplier} of a {@code Spliterator.OfLong}
ja: {@code Spliterator.OfLong}の{@code Supplier}

source: a {@code Supplier} of a {@code Spliterator}
ja: {@code Spliterator}の{@code Supplier}

source: a {@code Supplier} which returns a new, empty {@code Collection} of the appropriate type
ja: 新しく適切な型の空の{@code Collection}を返す{@code Supplier}

source: an associative, non-interfering, stateless function for combining two values
ja: 2つの値を統合するための、結合的で非干渉的で状態を持たない関数

source: an associative, non-interfering, stateless function for combining two values, which must be compatible with the accumulator function
ja: 2つの値を統合するための、結合的で非干渉的で状態を持たない関数。累積関数と整合する必要がある。

source: an associative, non-interfering, stateless function for incorporating an additional element into a result
ja: 結果に追加の要素を組み入れるための、結合的で非干渉的で状態を持たない関数

source: an array containing the elements in this stream
ja: このストリームの要素からなる配列

source: an array containing the elements of this stream
ja: このストリームの要素からなる配列

source: an empty sequential stream
ja: 空の逐次的ストリーム

source: an immutable set of collector characteristics
ja: コレクタの特性の不変な集合

source: an unordered stream
ja: 順序を持たないストリーム

source: an {@code IntSummaryStatistics} describing various summary data about the elements of this stream
ja: このストリームの要素の各種概要情報を表す{@code IntSummaryStatistics}

source: an {@code OptionalDouble} containing the average element of this stream, or an empty optional if the stream is empty
ja: このストリームの算術平均を含む{@code Optional}Double、またはこのストリームが空ならば空の{@code OptionalDouble}

source: an {@code OptionalDouble} containing the maximum element of this stream, or an empty optional if the stream is empty
ja: このストリームの最大要素を含む{@code OptionalDouble}、またはこのストリームが空ならば空の{@code OptionalDouble}

source: an {@code OptionalDouble} containing the minimum element of this stream, or an empty optional if the stream is empty
ja: このストリームの最小要素を含む{@code OptionalDouble}、またはこのストリームが空ならば空の{@code OptionalDouble}

source: an {@code OptionalDouble} describing some element of this stream, or an empty {@code OptionalDouble} if the stream is empty
ja: このストリームのある要素を表す{@code OptionalDouble}、またはこのストリームが空ならば空の{@code OptionalDouble}

source: an {@code OptionalDouble} describing the first element of this stream, or an empty {@code OptionalDouble} if the stream is empty
ja: このストリームの最初の要素を表す{@code OptionalDouble}、またはこのストリームが空ならば空の{@code OptionalDouble}

source: an {@code OptionalInt} containing the maximum element of this stream, or an empty {@code OptionalInt} if the stream is empty
ja: このストリームの最大要素を含む{@code OptionalInt}、またはこのストリームが空ならば空の{@code OptionalInt}

source: an {@code OptionalInt} containing the minimum element of this stream, or an empty {@code OptionalInt} if the stream is empty
ja: このストリームの最小要素を含む{@code OptionalInt}、またはこのストリームが空ならば空の{@code OptionalInt}

source: an {@code OptionalInt} describing some element of this stream, or an empty {@code OptionalInt} if the stream is empty
ja: このストリームのある要素を表す{@code OptionalInt}、またはこのストリームが空ならば空の{@code OptionalInt}

source: an {@code OptionalInt} describing the first element of this stream, or an empty {@code OptionalInt} if the stream is empty
ja: このストリームの最初の要素を表す{@code OptionalInt}、またはこのストリームが空ならば空の{@code OptionalInt}

source: an {@code OptionalLong} containing the maximum element of this stream, or an empty {@code OptionalLong} if the stream is empty
ja: このストリームの最大要素を含む{@code OptionalLong}、またはこのストリームが空ならば空の{@code OptionalLong}

source: an {@code OptionalLong} containing the minimum element of this stream, or an empty {@code OptionalLong} if the stream is empty
ja: このストリームの最小要素を含む{@code OptionalLong}、またはこのストリームが空ならば空の{@code OptionalLong}

source: an {@code OptionalLong} describing some element of this stream, or an empty {@code OptionalLong} if the stream is empty
ja: このストリームのある要素を表す{@code OptionalLong}、またはこのストリームが空ならば空の{@code OptionalLong}

source: an {@code OptionalLong} describing the first element of this stream, or an empty {@code OptionalLong} if the stream is empty
ja: このストリームの最初の要素を表す{@code OptionalLong}、またはこのストリームが空ならば空の{@code OptionalLong}

source: an {@code Optional} describing some element of this stream, or an empty {@code Optional} if the stream is empty
ja: このストリームのある要素を表す{@code Optional}、またはこのストリームが空ならば空の{@code Optional}

source: an {@code Optional} describing the first element of this stream, or an empty {@code Optional} if the stream is empty
ja: このストリームの最初の要素を表す{@code Optional}、またはこのストリームが空ならば空の{@code Optional}

source: an {@code Optional} describing the maximum element of this stream, or an empty {@code Optional} if the stream is empty
ja: このストリームの最大要素を表す{@code Optional}、またはこのストリームが空ならば空の{@code Optional}

source: an {@code Optional} describing the minimum element of this stream, or an empty {@code Optional} if the stream is empty
ja: このストリームの最小要素を表す{@code Optional}、またはこのストリームが空ならば空の{@code Optional}

source: an {@link Optional} describing the result of the reduction
ja: 簡約の結果を表す{@link Optional}

source: but in some cases equivalence may be relaxed to account for differences in order.
ja: ただし、ある場合には等価性は順序の違いを考慮するように緩めることもある。

source: but is not constrained to execute sequentially.
ja: ただし逐次的に実行されるとは制約されていない。

source: combining two result containers into one ( {@link #combiner()})
ja: 2つの結果コンテナの1つの結果コンテナへの統合({@link #combiner()})

source: creation of a new result container ( {@link #supplier()})
ja: 新しい結果コンテナの作成({@link #supplier()})

source: element type for the input and output of the reduction
ja: 簡約の入力と出力の要素型

source: if any argument is null
ja: いずれかの引数がnullの場合

source: if the builder has already transitioned to the built state
ja: ビルダが既に構築済状態に移行している場合

source: if the element selected is null
ja: 選択された要素がnullの場合

source: if the maximum element is null
ja: 最大要素がnullの場合

source: if the minimum element is null
ja: 最小要素がnullの場合

source: if the result of the reduction is null
ja: 簡約の結果がnullの場合

source: if the runtime type of the array returned from the array generator is not a supertype of the runtime type of every element in this stream
ja: 配列生成関数から返された配列の実行時型がこのストリームの全ての要素の部分型でない場合

source: if {@code maxSize} is negative
ja: {@code maxSize}が負の場合

source: if {@code n} is negative
ja: {@code n}が負の場合

source: if {@code true} then the returned stream is a parallel stream; if {@code false} the returned stream is a sequential stream.
ja: もし{@code true}であれば、返されるストリームは並列ストリームである。もし{@code false}であれば、返されるストリームは逐次ストリームである。

source: in most cases must be stateless (their result should not depend on any state that might change during execution of the stream pipeline).
ja: ほとんどの場合状態を持たない必要がある (結果がそのストリームパイプラインの実行中に変化する可能性がある状態に依存してはならない)

source: incorporating a new data element into a result container ( {@link #accumulator()})
ja: 新しいデータ要素の結果コンテナへの組み入れ({@link #accumulator()})

source: intermediate accumulation type of the downstream collector
ja: 下流のコレクタが中間的に累積する値の型

source: it may actually be counterproductive to perform the operation in parallel.
ja: この処理を並列に実行するのは実際には逆効果である。

source: must be non-interfering (they do not modify the stream source); and
ja: 非干渉的(non-interfering)である (情報源を変更しない)

source: or more compactly:
ja: もしくはより簡潔に次のようにできる。

source: or, pulling the mapping operation out of the accumulator function, we could express it more succinctly as:
ja: もしくは、写像処理を累積関数から抜き出すとさらに簡潔に次のように書ける。

source: or:
ja: あるいは次のようにも書ける。

source: performing an optional final transform on the container ( {@link #finisher()})
ja: コンテナに対する追加可能な最終的な変換({@link #finisher()})

source: result type of collector
ja: コレクタの結果型

source: result type of the downstream collector
ja: 下流のコレクタの結果型

source: result type of the resulting collector
ja: 返されるコレクタの結果型

source: the (inclusive) initial value
ja: 初期値(この値を含む)

source: the built stream
ja: 構築されたストリーム

source: the classifier function mapping input elements to keys
ja: 入力要素をキーに写像する分類関数

source: the concatenation of the two input streams
ja: 2つのストリームの連結

source: the count of elements in this stream
ja: このストリームの要素数

source: the delimiter to be used between each element
ja: 各要素の間に使われる区切り文字列

source: the element iterator for this stream
ja: このストリームの要素イテレータ

source: the element spliterator for this stream
ja: このストリームの要素スプリッテレータ

source: the element to add
ja: 追加する要素

source: the element type of the new stream
ja: 新しいストリーム要素の型

source: the element type of the resulting array
ja: 結果の配列の要素型

source: the elements of the new stream
ja: 新しいストリームの要素

source: the exclusive upper bound
ja: この値を含まない上界

source: the first stream
ja: 1つ目のストリーム

source: the identity value for the accumulating function
ja: 累積関数の単位元

source: the identity value for the combiner function
ja: 統合関数の単位元

source: the identity value for the reduction (also, the value that is returned when there are no input elements)
ja: 簡約の単位元(また、入力要素が無い場合に返される値)

source: the inclusive upper bound
ja: この値を含む上界

source: the initial element
ja: 初期要素

source: the intermediate accumulation type of the downstream collector
ja: 下流のコレクタが中間的に累積する値の型

source: the intermediate accumulation type of the {@code Collector}
ja: {@code Collector}の中間的な累積の型

source: the mapping function to apply to each element
ja: 各要素に適用する写像関数

source: the mapping function to produce keys
ja: キーを生成する写像関数

source: the mapping function to produce values
ja: 値を生成する写像関数

source: the mutable accumulation type of the reduction operation (often hidden as an implementation detail)
ja: 簡約処理の可変な累積型(実装の詳細として隠される場合が多い)

source: the new stream
ja: 新しいストリーム

source: the new {@code Collector}
ja: 新しい{@code Collector}

source: the number of elements the stream should be limited to
ja: ストリームを制限する要素数

source: the number of leading elements to skip
ja: スキップする先頭の要素数
